Tekla.Structures.Drawing.View.#ctor(Tekla.Structures.Drawing.ContainerView,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.CoordinateSystem,System.Collections.ArrayList,System.String)
Creates a new view instance with the given coordinate systems, part list and attributes file's filename.
View: The container view where the view is placed.
ViewCoordinateSystem: The coordinate system of the view restriction box.
DisplayCoordinateSystem: The coordinate system of the display plane.
PartList: An array list of identifiers of model objects to be shown in the view.
Attributes: The name of the attributes file to be used.